OpenPuya/IAP_APP_Fireware/PY32F4xx_IAP_APP_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_ll_sdio.c
/**
  ******************************************************************************
  * @file    py32f4xx_ll_sdio.c
  * @author  MCU Application Team
  * @brief   SDIO HAL module driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
  
/* Includes ------------------------------------------------------------------*/
#include "py32f4xx_hal.h"

/** @addtogroup PY32F4XX_HAL_Driver
  * @{
  */

/** @defgroup SDIO SDIO
* @brief SDIO LL module driver
  * @{
  */
  
#ifdef HAL_SD_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/**
  * @brief  DeInitialize the SDIO peripheral.
  * @retval None
  */
void SIDO_DeInit(void)
{
  __HAL_RCC_SDIO_FORCE_RESET();
  __HAL_RCC_SDIO_RELEASE_RESET();
}

/**
  * @brief  Initializes the SDIO peripheral according to the specified
  *         parameters in the SDIO_InitStruct.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_InitStruct : pointer to a SDIO_InitTypeDef structure
  *         that contains the configuration information for the SDIO peripheral.
  * @retval None
  */
void SDIO_Init(SDIO_TypeDef *SDIOx, SDIO_InitTypeDef* SDIO_InitStruct)
{
  uint32_t tmpreg;
  /* Check the parameters */
  assert_param(IS_SDIO_CLOCK_POWER_SAVE(SDIO_InitStruct->ClockPowerSave));
  assert_param(IS_SDIO_BUS_WIDE(SDIO_InitStruct->BusWide));
  assert_param(IS_SDIO_SMP_CLOCK(SDIO_InitStruct->SMPClock));
  assert_param(IS_SDIO_SMP_STATE(SDIO_InitStruct->SMPState));
  assert_param(IS_SDIO_CLOCK_Output(SDIO_InitStruct->CLockOutput));

  /*---------------------------- SDIO Card Width Configuration ---------------*/
  tmpreg = SDIOx->CLKCR;
  tmpreg &= ~(SDIO_CLKCR_WIDBUS_Msk);
  tmpreg |= SDIO_InitStruct->BusWide;
  SDIOx->CLKCR = tmpreg;
  
  /*---------------------------- SDIO CLK PWR SAVE Configuration -------------*/
  tmpreg = SDIOx->CLKCR;
  tmpreg &= ~(SDIO_CLKCR_PWRSAV_Msk);
  tmpreg |= SDIO_InitStruct->ClockPowerSave;
  SDIOx->CLKCR = tmpreg;
  
  /*---------------------------- SDIO CLK SMP Configuration ------------------*/
  tmpreg = SDIOx->CLKCR;
  tmpreg &= ~(SDIO_CLKCR_SMPCLKSEL_Msk | SDIO_CLKCR_SMPEN);
  tmpreg |= ((SDIO_InitStruct->SMPClock)| (SDIO_InitStruct->SMPState));
  SDIOx->CLKCR = tmpreg;

  /*---------------------------- SDIO CLK OUTPUT Configuration ---------------*/
  tmpreg = SDIOx->CLKCR;
  tmpreg &= ~(SDIO_CLKCR_CKSEL_Msk);
  tmpreg |= SDIO_InitStruct->CLockOutput;
  SDIOx->CLKCR = tmpreg;
  
  /* Set Clock Divider and Enable */
  SDIO_SetClock(SDIOx,SDIO_InitStruct->ClockDiv);
}

/**
  * @brief  Fills each SDIO_InitStruct member with its default value.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_InitStruct: pointer to an SDIO_InitTypeDef structure which
  *         will be initialized.
  * @retval None
  */
void SDIO_StructInit(SDIO_InitTypeDef* SDIO_InitStruct)
{
  /* SDIO_InitStruct members default value */
  SDIO_InitStruct->ClockDiv       = 0x00;
  SDIO_InitStruct->ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
  SDIO_InitStruct->BusWide        = SDIO_BUS_WIDE_1B;
  SDIO_InitStruct->SMPClock       = SDIO_SMP_CLOCK_SDCLK_DEFAULT;
  SDIO_InitStruct->SMPState       = SDIO_SMP_ENABLE;
  SDIO_InitStruct->CLockOutput    = SDIO_CLOCK_OUTPUT_OFFSET180;
}

/**
  * @brief  The SDIO loads each of these registers only when the start_cmd bit and the
  *         Update_clk_regs_only bit in the CMD register are set. When a command is successfully loaded, the
  *         SDIO Controller clears this bit, unless the SDIO Controller already has another command in the
  *         queue, at which point it gives an HLE (Hardware Locked Error);
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_InitStruct: pointer to an SDIO_InitTypeDef structure which
  *         will be initialized.
  *         SDIO_ClkDiv: clock dividor
  * @retval None
  */
void SDIO_SetClock(SDIO_TypeDef *SDIOx,uint32_t SDIO_ClkDiv)
{
  uint32_t tmpreg;
  tmpreg = SDIOx->CLKCR;
  /* 1. Confirm that no card is engaged in any transaction; if there is a transaction, wait until it finishes. */
  while(SDIO_IsCardBusy(SDIOx));
  /* 2. Stop all clocks by writing xxxx0000 to the CLKENA register. Set the start_cmd,
  *   Update_clk_regs_only, and wait_prvdata_complete bits in the CMD register. Wait until start_cmd is
  *   cleared or an HLE is set; in case of an HLE, repeat the command.
  */
  
  SDIO_ClockCmd(SDIOx,DISABLE);
  /* 3. Program the CLKDIV and CLKSRC registers, as required. Set the start_cmd, Update_clk_regs_only,
  *    and wait_prvdata_complete bits in the CMD register. Wait until start_cmd is cleared or an HLE is
  *    set; in case of an HLE, repeat the command.
  */
  tmpreg &= ~(SDIO_CLKCR_CLKDIV_Msk);
  tmpreg |= (uint32_t)(SDIO_ClkDiv & SDIO_CLKCR_CLKDIV_Msk);
  
  /*4. Re-enable all clocks by programming the CLKENA register. Set the start_cmd,
  *   Update_clk_regs_only, and wait_prvdata_complete bits in the CMD register. Wait until start_cmd is
  *   cleared or an HLE is set; in case of an HLE, repeat the command.
  */
  SDIOx->CLKCR = tmpreg;
  SDIO_ClockCmd(SDIOx,ENABLE);
}

/**
  * @brief  Enables or disables the SDIO Clock.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  NewState: new state of the SDIO Clock.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_ClockCmd(SDIO_TypeDef *SDIOx,FunctionalState NewState)
{
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    tmpreg = SDIOx->CLKCR;
    
    if(!NewState)
    {
        tmpreg &= ~(SDIO_CLKCR_CLKEN_Msk);
    }
    else
    {
        tmpreg |= (SDIO_CLKCR_CLKEN_Msk);
    }
    SDIOx->CLKCR = tmpreg;


    /* Wait until start_cmd is cleared or an HLE is set; in case of an HLE, repeat the command */
    SDIOx->CMD |= (SDIO_CMD_STARTCMD_Msk | SDIO_CMD_REGSYNC_Msk |SDIO_CMD_WAITPEND_Msk);    
    while(SDIOx->CMD & SDIO_CMD_STARTCMD_Msk);

