OpenPuya/IAP_APP_Fireware/PY32F4xx_IAP_APP_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_ll_sdio.c
}

/**
  * @brief  If CTYPE[16] = 1, the card at port0 is in 8-bit mode. Note that the CTYPE[0] value is ignored; it is
  *         recommended to keep this set to 0.
  *         If CTYPE[16] = 0, the card at port0 is in either 1-bit or 4-bit mode, depending upon the value of
  *         CTYPE[0]; that is, if CTYPE[0] = 1 - 4-bit, CTYPE[0] = 0 - 1-bit.
  * @param  SDIOx:Pointer to SDIO register base.
  * @param  SDIO_Width: This parameter can be one of the following values:
  *                     SDIO_BUS_WIDE_1B
  *                     SDIO_BUS_WIDE_4B
  *                     SDIO_BUS_WIDE_8B
* @retval None
  */
void SDIO_SetCardBusWidth(SDIO_TypeDef *SDIOx,uint32_t SDIO_Width)
{
    uint32_t tmpreg;
    /* Check the parameters */
    assert_param(IS_SDIO_BUS_WIDE(WIDE));

    /*---------------------------- SDIO CLKTYPE Configuration ------------------------*/
    tmpreg = SDIOx->CLKCR;
    tmpreg &= ~(SDIO_CLKCR_WIDBUS_Msk);
    tmpreg |= SDIO_Width;

    SDIOx->CLKCR = tmpreg;
}

/**
  * @brief  Sets the power status of the controller.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_PowerState: new state of the Power state.
  *          This parameter can be one of the following values:
  *            @arg SDIO_POWER_STATE_OFF: SDIO Power OFF
  *            @arg SDIO_POWER_STATE_ON : SDIO Power ON
  * @retval None
  */
void SDIO_SetPowerState(SDIO_TypeDef *SDIOx,uint32_t SDIO_PowerState)
{
  /* Check the parameters */
  assert_param(IS_SDIO_POWER_STATE(SDIO_PowerState));

  SDIOx->POWER = SDIO_PowerState;
}

/**
  * @brief  Gets the power status of the controller.
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval Power status of the controller. The returned value can be one of the
  *         following values:
  *            - 0x00: Power OFF
  *            - 0x01: Power ON
  */
uint32_t SDIO_GetPowerState(SDIO_TypeDef *SDIOx)
{
    uint32_t tmpreg = 0;
    tmpreg = SDIOx->POWER;
        
    tmpreg &= SDIO_POWER_PWRCTRL_Msk;
    

  return (uint32_t)(tmpreg >> SDIO_POWER_PWRCTRL_Pos);
}

/**
  * @brief  Send stop command at end of data transfer or Not
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  NewState :   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_IsAutoStopCmd(SDIO_TypeDef *SDIOx,FunctionalState NewState)
{
  uint32_t tmpreg = 0;
  tmpreg = SDIOx->CMD;
      
  tmpreg &= ~SDIO_CMD_AUTOSTOP_Msk;
  
  if(NewState)
  {
    tmpreg |= SDIO_CMD_AUTOSTOP;
  }
  
  SDIOx->CMD = tmpreg;
}

/**
  * @brief  Initializes the SDIO Command according to the specified 
  * @param  SDIOx: Pointer to SDIO register base.
  *         parameters in the SDIO_CmdInitStruct and send the command.
  * @param  SDIO_CmdInitStruct : pointer to a SDIO_CmdInitTypeDef 
  *         structure that contains the configuration information for the SDIO 
  *         command.
  * @retval None
  */
void SDIO_SendCommand(SDIO_TypeDef *SDIOx,SDIO_CmdInitTypeDef *SDIO_CmdInitStruct)
{
  uint32_t tmpreg = 0;

  /* Set the SDIO Argument value */
  SDIOx->ARG = SDIO_CmdInitStruct->Argument;
  /* Get the SDIO CMD value */
  tmpreg = SDIOx->CMD;
    
  /* data_expected 0 0-No data transfer expected (read/write) 1-Data transfer expected (read/write) clear reg sync */
  tmpreg &= ~SDIO_CMD_REGSYNC_Msk;
  tmpreg &= ~(SDIO_CMD_STARTCMD_Msk| \
              SDIO_CMD_DEXPECT_Msk | \
              SDIO_CMD_AUTOINIT_Msk| \
              SDIO_CMD_WAITPEND_Msk| \
              SDIO_CMD_WAITRESP_Msk| \
              SDIO_CMD_RESPLEN_Msk | \
              SDIO_CMD_CHECKRESPCRC_Msk);
  
  tmpreg &= ~SDIO_CMD_CMDINDEX_Msk;

  tmpreg |= (uint32_t)(SDIO_CmdInitStruct->Response     |
                       SDIO_CmdInitStruct->Response_CRC |
                       SDIO_CmdInitStruct->DataTransfer |
                       SDIO_CmdInitStruct->Wait         |
                       SDIO_CmdInitStruct->InitSignal   |
                       SDIO_CmdInitStruct->CmdIndex);

  SDIOx->CMD = tmpreg;

  /* bit 31 start_cmd should write after all other CMD register bits have been wrote */
  tmpreg |=  SDIO_CmdInitStruct->CPSM;
  SDIOx->CMD = tmpreg;
}

/**
  * @brief  Fills each SDIO_CmdInitStruct member with its default value.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_CmdInitStruct: pointer to an SDIO_CmdInitTypeDef 
  *         structure which will be initialized.
  * @retval None
  */
void SDIO_CmdStructInit(SDIO_CmdInitTypeDef* SDIO_CmdInitStruct)
{
  /* SDIO_CmdInitStruct members default value */
  SDIO_CmdInitStruct->Argument = 0x00;
  SDIO_CmdInitStruct->CmdIndex = 0x00;
  SDIO_CmdInitStruct->Response = SDIO_RESPONSE_NO;
  SDIO_CmdInitStruct->Wait     = SDIO_WAIT_NO;
  SDIO_CmdInitStruct->CPSM     = SDIO_CPSM_DISABLE;
}

/**
  * @brief  Returns response received from the card for the last command.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_RESP: Specifies the SDIO response register. 
  *          This parameter can be one of the following values:
  *            @arg SDIO_RESP1: Response Register 1
  *            @arg SDIO_RESP2: Response Register 2
  *            @arg SDIO_RESP3: Response Register 3
  *            @arg SDIO_RESP4: Response Register 4
  * @retval The Corresponding response register value.
  */
uint32_t SDIO_GetResponse(SDIO_TypeDef *SDIOx,uint32_t SDIO_RESP)
{
    __IO uint32_t tmp = 0;

    /* Check the parameters */
    assert_param(IS_SDIO_RESP(SDIO_RESP));

    tmp = (uint32_t)(&(SDIOx->RESP0)) + SDIO_RESP;

    return (*(__IO uint32_t *) tmp);
}
/**
  * @brief  Initializes the SDIO data path according to the specified 
  *         parameters in the SDIO_DataInitStruct.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_DataInitStruct : pointer to a SDIO_DataInitTypeDef structure 
  *         that contains the configuration information for the SDIO command.
  * @retval None
  */
void SDIO_DataConfig(SDIO_TypeDef *SDIOx,SDIO_DataInitTypeDef* SDIO_DataInitStruct)
{
    uint32_t tmpreg = 0;

    /* Set the SDIO Data TimeOut value */
    SDIOx->TMOUT = SDIO_DataInitStruct->DataTimeOut << 8 | 0x64;

