OpenPuya/IAP_APP_Fireware/PY32F4xx_IAP_APP_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_ll_sdio.c
    /* Set the SDIO DataLength value */
    SDIOx->DLEN = SDIO_DataInitStruct->DataLength;

    /* Set the SDIO BlockSize value */
    SDIOx->BLKSIZ = SDIO_DataInitStruct->DataBlockSize;

    tmpreg = SDIOx->CMD;
    tmpreg &= ~(SDIO_CMD_DTMODE_Msk | SDIO_CMD_DIR_Msk);

    tmpreg |= SDIO_DataInitStruct->TransferDir | SDIO_DataInitStruct->TransferMode;

    SDIOx->CMD = tmpreg;
}
/**
  * @breif FIFO threshold watermark level when transmitting data to card.
  *        When FIFO data count is less than or equal to this number,
  *        DMA/FIFO request is raised. If Interrupt is enabled, then interrupt
  *        occurs. During end of packet, request or interrupt is generated,
  *        regardless of threshold programming.
  *        In non-DMA mode, when transmit FIFO threshold (TXDR)
  *        interrupt is enabled, then interrupt is generated instead of DMA
  *        request. During end of packet, on last interrupt, host is
  *        responsible for filling FIFO with only required remaining bytes (not
  *        before FIFO is full or after CIU completes data transfers, because
  *        FIFO may not be empty).
  *        In DMA mode, at end of packet, if last transfer is less than burst
  *        size, DMA controller does single cycles until required bytes are
  *        transferred.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_WaterMark: FIFO threshold watermark level when receiving data to card.
            This parameter can be one or a combination of the following values:
  *         SDIO_FIFO_WMARK_1
  *         SDIO_FIFO_WMARK_2
  *         ...

  *         SDIO_FIFO_WMARK_16
  * @retval None

  **/
void SDIO_SetTxWaterMark(SDIO_TypeDef *SDIOx,uint16_t SDIO_WaterMark)
{
    uint32_t tmpreg = 0;

    tmpreg = SDIOx->FIFOTH;

    tmpreg &= ~(SDIO_FIFOTH_TXWMARK_Msk);
    tmpreg |= ((SDIO_WaterMark << SDIO_FIFOTH_TXWMARK_Pos) & SDIO_FIFOTH_TXWMARK_Msk);
    
    SDIOx->FIFOTH = tmpreg;
}

/**
  * @breif FIFO threshold watermark level when receiving data to card.
  *        When FIFO data count reaches greater than this number,
  *        DMA/FIFO request is raised. During end of packet, request is
  *        generated regardless of threshold programming in order to
  *        complete any remaining data.
  *        In non-DMA mode, when receiver FIFO threshold (RXDR)
  *        interrupt is enabled, then interrupt is generated instead of DMA request.
  *        During end of packet, interrupt is not generated if threshold
  *        programming is larger than any remaining data. It is responsibility
  *        of host to read remaining bytes on seeing Data Transfer Done interrupt.
  *        In DMA mode, at end of packet, even if remaining bytes are less
  *        than threshold, DMA request does single transfers to flush out any
  *        remaining bytes before Data Transfer Done interrupt is set.
  * @param  SDIOx:Pointer to SDIO register base.
  * @param  SDIO_WaterMark: FIFO threshold watermark level when receiving data to card.
            This parameter can be one or a combination of the following values:
  *         SDIO_FIFO_WMARK_1
  *         SDIO_FIFO_WMARK_2
  *         ...

  *         SDIO_FIFO_WMARK_16
  * @retval None
  *
  **/
void SDIO_SetRxWaterMark(SDIO_TypeDef *SDIOx,uint16_t SDIO_WaterMark)
{
    uint32_t tmpreg = 0;

    tmpreg = SDIOx->FIFOTH;

    tmpreg &= ~(SDIO_FIFOTH_RXWMARK_Msk);
    tmpreg |= ((SDIO_WaterMark << SDIO_FIFOTH_RXWMARK_Pos) & SDIO_FIFOTH_RXWMARK_Msk);

    SDIOx->FIFOTH = tmpreg;
}
/**
  * @brief  Returns the number of words left to be written to or read from FIFO.
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval Remaining number of words.
  */
uint16_t SDIO_GetFifoCount(SDIO_TypeDef *SDIOx)
{
  uint16_t fifo_cnt = 0;
  uint32_t tmpreg = 0;

  tmpreg = SDIOx->STATUS;

  tmpreg &= SDIO_STATUS_FIFOCNT_Msk;
  fifo_cnt = (uint16_t)(tmpreg >> SDIO_STATUS_FIFOCNT_Pos);

  return (fifo_cnt);
}

/**
  * @brief  Returns Command FSM states
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval Command FSM states
  */
uint16_t SDIO_GetCmdState(SDIO_TypeDef *SDIOx)
{
  uint16_t cmdState = 0;
  uint32_t tmpreg = 0;

  tmpreg = SDIOx->STATUS;
  tmpreg &= SDIO_STATUS_CMDFSM_Msk;

  cmdState = (uint16_t)(tmpreg >> SDIO_STATUS_CMDFSM_Pos);

  return (cmdState);
}

/**
  *@breif Is card data busy
  **/
uint32_t SDIO_IsCardBusy(SDIO_TypeDef *SDIOx)
{
  uint32_t tmpreg = 0;
    
  tmpreg = SDIOx->STATUS;
  tmpreg &= SDIO_STATUS_CARDBSY_Msk;
    
  return(tmpreg >> SDIO_STATUS_CARDBSY_Pos);
}
/**
  * @brief  Returns FIFO is empty status
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval FIFO is empty or not
  */
uint32_t SDIO_IsFifoEmpty(SDIO_TypeDef *SDIOx)
{
  uint32_t tmpreg = 0;
    
  tmpreg = SDIOx->STATUS;
  tmpreg &= SDIO_STATUS_FIFOE_Msk;
    
  return(tmpreg >> SDIO_STATUS_FIFOE_Pos);

}
/**
  * @brief  Returns FIFO is full status
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval FIFO is full or not
  */
uint32_t SDIO_IsFifoFull(SDIO_TypeDef *SDIOx)
{
  uint32_t tmpreg = 0;
    
  tmpreg = SDIOx->STATUS;
  tmpreg &= SDIO_STATUS_FIFOF_Msk;
    
  return(tmpreg >> SDIO_STATUS_FIFOF_Pos);
}

/**
  * @brief  Returns Index of previous response, including any auto-stop sent by core
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval Index of previous response
  */
uint8_t SDIO_GetRspIdx(SDIO_TypeDef *SDIOx)
{
  uint32_t tmpreg = 0;
    
  tmpreg = SDIOx->RESPCMD;
  tmpreg &= SDIO_RESPCMD_RESPCMD_Msk;
    
  return (uint8_t)(tmpreg >> SDIO_RESPCMD_RESPCMD_Pos);
}

/**
  * @brief  Fills each SDIO_DataInitStruct member with its default value.
  * @param  SDIO_DataInitStruct: pointer to an SDIO_DataInitTypeDef structure 
  *         which will be initialized.
  * @retval None
  */
void SDIO_DataStructInit(SDIO_DataInitTypeDef* SDIO_DataInitStruct)
{
  /* SDIO_DataInitStruct members default value */
  SDIO_DataInitStruct->DataTimeOut   = 0xFFFFFFFF;
  SDIO_DataInitStruct->DataLength    = 0x00;
  SDIO_DataInitStruct->DataBlockSize = SDIO_DATABLOCKSIZE_512B;
  SDIO_DataInitStruct->TransferDir   = SDIO_TRANSFERDIR_TO_CARD;
  SDIO_DataInitStruct->TransferMode  = SDIO_TRANSFERMODE_BLOCK;
}

/**
  * @brief  Read one data word from Rx FIFO.
  * @param  SDIOx: Pointer to SDIO register base.
  * @retval Data received
  */
uint32_t SDIO_ReadData(SDIO_TypeDef * SDIOx)
{
  return (SDIOx->FIFODATA);
}

/**
  * @brief  Write one data word to Tx FIFO.
  * @param  SDIOx:Pointer to SDIO register base.
  * @param  Data: 32-bit data word to write.
  * @retval None
  */
void SDIO_WriteData(SDIO_TypeDef * SDIOx,uint32_t Data)
{
  SDIOx->FIFODATA = Data;
}

/**
  * @brief  Enables or disables the SDIO DMA request.
  * @param  SDIOx:Pointer to SDIO register base.
  * @param  NewState: new state of the selected SDIO DMA request.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_DMACmd(SDIO_TypeDef * SDIOx,FunctionalState NewState)
{
  uint32_t tmpreg;

  tmpreg = SDIOx->CTRL;

  tmpreg &= ~(SDIO_CTRL_DMAEN_Msk);

