OpenPuya/IAP_APP_Fireware/PY32F4xx_IAP_APP_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_ll_sdio.c
  if(NewState)
  {
    tmpreg |= SDIO_CTRL_DMAEN;
  }

  SDIOx->CTRL = tmpreg;
}

/**
  * @brief  Enables or disables the SDIO Global interrupt.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  NewState: new state of the selected SDIO DMA request.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO_ITCmd(SDIO_TypeDef * SDIOx,FunctionalState NewState)
{
  uint32_t tmpreg;

  tmpreg = SDIOx->CTRL;

  tmpreg &= ~(SDIO_CTRL_INTEN_Msk);

  if(NewState)
  {
    SDIOx->CTRL = tmpreg | SDIO_CTRL_INTEN_Msk;
  }
  
  SDIOx->CTRL = tmpreg;
}
/**
  * @brief  Enable the SDIO's interrupt .
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_IT: specifies the interrupt pending bit to clear. 
  *          This parameter can be one or a combination of the following values:
  *            @arg SDIO_IT_CD: Card detect (CD)
  *            @arg SDIO_IT_RE: Response error (RE)
  *            @arg SDIO_IT_CMDD: Command done (CD)
  *            @arg SDIO_IT_DTO:  Data transfer over (DTO)
  *            @arg SDIO_IT_TXDR: Transmit FIFO data request (TXDR)
  *            @arg SDIO_IT_RXDR: Receive FIFO data request (RXDR)
  *            @arg SDIO_IT_RCRC: Response CRC error (RCRC)
  *            @arg SDIO_IT_DCRC: Data CRC error (DCRC)
  *            @arg SDIO_IT_RTO:  Response timeout (RTO)/Boot Ack Received (BAR)
  *            @arg SDIO_IT_DRTO: Data read timeout (DRTO)/Boot Data Start (BDS)
  *            @arg SDIO_IT_HTO:  Data starvation-by-host timeout (HTO) /Volt_switch_int
  *            @arg SDIO_IT_FRUN: FIFO underrun/overrun error (FRUN)
  *            @arg SDIO_IT_HLE:  Hardware locked write error (HLE)
  *            @arg SDIO_IT_SBE:  Start-bit error (SBE)
  *            @arg SDIO_IT_ACD:  Auto command done (ACD)
  *            @arg SDIO_IT_EBE:  End-bit error (read)/write no CRC (EBE)
  *            @arg SDIO_IT_FROM_CARD: Interrupt from SDIO card
  * @retval None
  */
void SDIO_ITConfig(SDIO_TypeDef * SDIOx,uint32_t SDIO_IT, FunctionalState NewState)
{        
  /* Check the parameters */
  assert_param(IS_SDIO_IT(SDIO_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState)
  {
      /* Enable the SDIO interrupts */
      SDIOx->INTMASK |= SDIO_IT;
  }
  else
  {
      /* Disable the SDIO interrupts */
      SDIOx->INTMASK &= ~SDIO_IT;
  }
}

/**
  * @brief  Clears the SDIO's interrupt pending bits.
  * @param  SDIOx: Pointer to SDIO register base.
  * @param  SDIO_IT: specifies the interrupt pending bit to clear. 
  *          This parameter can be one or a combination of the following values:
  *            @arg SDIO_IT_CD: Card detect (CD)
  *            @arg SDIO_IT_RE: Response error (RE)
  *            @arg SDIO_IT_CMDD: Command done (CD)
  *            @arg SDIO_IT_DTO:  Data transfer over (DTO)
  *            @arg SDIO_IT_TXDR: Transmit FIFO data request (TXDR)
  *            @arg SDIO_IT_RXDR: Receive FIFO data request (RXDR)
  *            @arg SDIO_IT_RCRC: Response CRC error (RCRC)
  *            @arg SDIO_IT_DCRC: Data CRC error (DCRC)
  *            @arg SDIO_IT_RTO:  Response timeout (RTO)/Boot Ack Received (BAR)
  *            @arg SDIO_IT_DRTO: Data read timeout (DRTO)/Boot Data Start (BDS)
  *            @arg SDIO_IT_HTO:  Data starvation-by-host timeout (HTO) /Volt_switch_int
  *            @arg SDIO_IT_FRUN: FIFO underrun/overrun error (FRUN)
  *            @arg SDIO_IT_HLE:  Hardware locked write error (HLE)
  *            @arg SDIO_IT_SBE:  Start-bit error (SBE)
  *            @arg SDIO_IT_ACD:  Auto command done (ACD)
  *            @arg SDIO_IT_EBE:  End-bit error (read)/write no CRC (EBE)
  *            @arg SDIO_IT_FROM_CARD: Interrupt from SDIO card
  * @retval None
  */
void SDIO_ClearITStatus(SDIO_TypeDef * SDIOx,uint32_t SDIO_IT)
{
  /* Check the parameters */
  assert_param(IS_SDIO_CLEAR_FLAG(SDIO_FLAG));

  SDIOx->INTSTS |= SDIO_IT;
}
/**
  * @brief  Clears the SDIO's interrupt pending bits.
  * @param  SDIOx:Pointer to SDIO register base.
  * @param  SDIO_IT: specifies the interrupt pending bit to clear. 
  *          This parameter can be one or a combination of the following values:
  *            @arg SDIO_IT_CD: Card detect (CD)
  *            @arg SDIO_IT_RE: Response error (RE)
  *            @arg SDIO_IT_CMDD: Command done (CD)
  *            @arg SDIO_IT_DTO:  Data transfer over (DTO)
  *            @arg SDIO_IT_TXDR: Transmit FIFO data request (TXDR)
  *            @arg SDIO_IT_RXDR: Receive FIFO data request (RXDR)
  *            @arg SDIO_IT_RCRC: Response CRC error (RCRC)
  *            @arg SDIO_IT_DCRC: Data CRC error (DCRC)
  *            @arg SDIO_IT_RTO:  Response timeout (RTO)/Boot Ack Received (BAR)
  *            @arg SDIO_IT_DRTO: Data read timeout (DRTO)/Boot Data Start (BDS)
  *            @arg SDIO_IT_HTO:  Data starvation-by-host timeout (HTO) /Volt_switch_int
  *            @arg SDIO_IT_FRUN: FIFO underrun/overrun error (FRUN)
  *            @arg SDIO_IT_HLE:  Hardware locked write error (HLE)
  *            @arg SDIO_IT_SBE:  Start-bit error (SBE)
  *            @arg SDIO_IT_ACD:  Auto command done (ACD)
  *            @arg SDIO_IT_EBE:  End-bit error (read)/write no CRC (EBE)
  *            @arg SDIO_IT_FROM_CARD: Interrupt from SDIO card
  * @retval None
  */
ITStatus SDIO_GetITStatus(SDIO_TypeDef * SDIOx,uint32_t SDIO_IT)
{
  ITStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_SDIO_GET_IT(SDIO_IT));
  if ((SDIOx->INTSTS & SDIO_IT) != (uint32_t)RESET)
  {
      bitstatus = SET;
  }
  else
  {
      bitstatus = RESET;
  }
  return bitstatus;
}

#endif /* HAL_SDIO_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
